In [2]:
import pandas as pd

In [3]:
pip install pandas

Requirement already satisfied: pandas in /opt/conda/lib/python3.10/site-packages (1.5.2)
Requirement already satisfied: python-dateutil>=2.8.1 in /opt/conda/lib/python3.10/site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in /opt/conda/lib/python3.10/site-packages (from pandas) (2022.6)
Requirement already satisfied: numpy>=1.21.0 in /opt/conda/lib/python3.10/site-packages (from pandas) (1.23.5)
Requirement already satisfied: six>=1.5 in /opt/conda/lib/python3.10/site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [ ]:
Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [12]:
df = pd.Series([4, 8, 15, 16, 23,42],index = None)

In [13]:
df

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [ ]:
Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
variable print it.

In [14]:
l = [4,5,66,888,99,44,32,57,62,55]

In [16]:
df = pd.Series(l)

In [17]:
df

0      4
1      5
2     66
3    888
4     99
5     44
6     32
7     57
8     62
9     55
dtype: int64

In [ ]:
Q3. Create a Pandas DataFrame that contains the following data:

In [19]:
Human= { 'Name' : ['Alice','Bob','Claire'],
          'Age':[25,30,27],
          'Gender':['Female','Male','Female']


}

In [21]:
df = pd.DataFrame(Human)

In [22]:
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [ ]:
Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

In [ ]:
Series can only contain single list with index, 
whereas dataframe can be made of more than one series or we can say that a dataframe is a collection of series 
that can be used to analyse the data

In [ ]:
Example in Q2 & Q3

In [ ]:
Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
you give an example of when you might use one of these functions?

In [ ]:
1. read_csv()
2. head()
3. describe()
4. memory_usage()
5. astype()
6. loc[:]
7. to_datetime()
8. value_counts()
9. drop_duplicates()
10. groupby()
11. merge()
12. sort_values()
13.fillna()

In [ ]:
Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

In [ ]:
Series : Immutable
DataFrame : Mutable

In [ ]:
Q7. Create a DataFrame using multiple Series. Explain with an example.

In [25]:
Vehicle = { 'Bikes' : ['Continental_GT','Kawasaki','FZ','Ducati'],
            'Cars' : ['Thar','Forniture','GT','Harrier'],
            'spped': ['160','340','110','320']
    
    
    
    
}

In [26]:
df1 = pd.DataFrame(Vehicle)

In [27]:
df1

            Bikes       Cars spped
0  Continental_GT       Thar   160
1        Kawasaki  Forniture   340
2              FZ         GT   110
3          Ducati    Harrier   320